#!/usr/bin/env python
# coding: utf-8

# In[10]:


# 주석 커맨트
# 코드에 설명하는 용도  >> 필수로 해주는 것이 좋음 단 간결하게
# 프롬프트에 입력하여 직접 커맨드 입력 가능 
# >>> 

print("Hello~")


# <p style="color:red;"> 명령어 입력후 결과 확인 : 대화형 방식 </p>
# <p style="color:red;"> 파일 작성후 실행하는 방식: 스크립트 방식 </p>
# 

# In[12]:


# 종료 명령어
exit()


# <h2>코딩 컨밴션</h2>
# 
# <li>들여쓰기(Indentation)는 공백 4칸을 권장
# <li>한 줄은 최대 79자까지
# <li>클래스 내의 메소드 정의는 1줄 씩 띄어쓰기
# <li>주석은 항상 갱신, 불필요한 주석은 삭제
# <li>소문자 L, 대문자 O, 대문자 I는 변수명으로 사용하지 말 것 (가독성) (권장사항)
# <li>함수명은 소문자로 구성, 필요하면 밑줄로 나눔</li>
# 
# <h2> 주석 작성 방법 </h2>
# <li> '''''' 로 작성

# In[2]:


'''
여러줄 주석 작성 방식
IDE를 이용하면 편하지만 알고 있으면 좋음
'''
"""
쌍따움표도 주석 작성가능
"""


# In[ ]:




